###############################################################################
# Created by write_sdc
# Mon May 30 01:51:10 2022
###############################################################################
current_design sbox
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clock -period 100.0000 
set_clock_uncertainty 0.2500 clock
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[0]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[10]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[11]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[12]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[13]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[14]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[15]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[16]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[17]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[18]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[19]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[1]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[20]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[21]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[22]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[23]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[24]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[25]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[26]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[27]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[28]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[29]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[2]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[30]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[31]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[3]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[4]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[5]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[6]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[7]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[8]}]
set_input_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg[9]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[10]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[11]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[12]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[13]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[14]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[15]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[16]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[17]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[18]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[19]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[20]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[21]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[22]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[23]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[24]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[25]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[26]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[27]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[28]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[29]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[2]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[30]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[31]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[3]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[4]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[5]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[6]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[7]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[8]}]
set_output_delay 20.0000 -clock [get_clocks {clock}] -add_delay [get_ports {io_msg_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {io_msg_out[31]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[30]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[29]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[28]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[27]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[26]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[25]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[24]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[23]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[22]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[21]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[20]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[19]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[18]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[17]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[16]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[15]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[14]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[13]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[12]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[11]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[10]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[9]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[8]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[7]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[6]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[5]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[4]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[3]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[2]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[1]}]
set_load -pin_load 0.0334 [get_ports {io_msg_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_msg[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
